jimherd/Robokid_B3/mc9s08aw60.h
#define TPM1C4SC_ELSxA    _TPM1C4SC.Bits.ELS4A
#define TPM1C4SC_ELSxB    _TPM1C4SC.Bits.ELS4B
#define TPM1C4SC_MSxA     _TPM1C4SC.Bits.MS4A
#define TPM1C4SC_MSxB     _TPM1C4SC.Bits.MS4B
#define TPM1C4SC_CHxIE    _TPM1C4SC.Bits.CH4IE
#define TPM1C4SC_CHxF     _TPM1C4SC.Bits.CH4F

#define TPM1C5SC_ELSxA    _TPM1C5SC.Bits.ELS5A
#define TPM1C5SC_ELSxB    _TPM1C5SC.Bits.ELS5B
#define TPM1C5SC_MSxA     _TPM1C5SC.Bits.MS5A
#define TPM1C5SC_MSxB     _TPM1C5SC.Bits.MS5B
#define TPM1C5SC_CHxIE    _TPM1C5SC.Bits.CH5IE
#define TPM1C5SC_CHxF     _TPM1C5SC.Bits.CH5F

#define TPM2C0SC_ELSxA    _TPM2C0SC.Bits.ELS0A
#define TPM2C0SC_ELSxB    _TPM2C0SC.Bits.ELS0B
#define TPM2C0SC_MSxA     _TPM2C0SC.Bits.MS0A
#define TPM2C0SC_MSxB     _TPM2C0SC.Bits.MS0B
#define TPM2C0SC_CHxIE    _TPM2C0SC.Bits.CH0IE
#define TPM2C0SC_CHxF     _TPM2C0SC.Bits.CH0F

#define TPM2C1SC_ELSxA    _TPM2C1SC.Bits.ELS1A
#define TPM2C1SC_ELSxB    _TPM2C1SC.Bits.ELS1B
#define TPM2C1SC_MSxA     _TPM2C1SC.Bits.MS1A
#define TPM2C1SC_MSxB     _TPM2C1SC.Bits.MS1B
#define TPM2C1SC_CHxIE    _TPM2C1SC.Bits.CH1IE
#define TPM2C1SC_CHxF     _TPM2C1SC.Bits.CH1F
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */
/*
 * Follows changes from the database 2.87.149 version */
#define IIC1A_ADDR0                      This_symb_has_been_depreciated
#define IIC1A_ADDR0_BITNUM               This_symb_has_been_depreciated
#define IIC1A_ADDR0_MASK                 This_symb_has_been_depreciated
#define NVPROT_FPS0                      This_symb_has_been_depreciated
#define NVPROT_FPS0_BITNUM               This_symb_has_been_depreciated
#define NVPROT_FPS0_MASK                 This_symb_has_been_depreciated
#define AD1SC1                           ADC1SC1
#define _AD1SC1                          _ADC1SC1
#define AD1SC1_ADCH0                     ADC1SC1_ADCH0
#define AD1SC1_ADCH0_MASK                ADC1SC1_ADCH0_MASK
#define AD1SC1_ADCH1                     ADC1SC1_ADCH1
#define AD1SC1_ADCH1_MASK                ADC1SC1_ADCH1_MASK
#define AD1SC1_ADCH2                     ADC1SC1_ADCH2
#define AD1SC1_ADCH2_MASK                ADC1SC1_ADCH2_MASK
#define AD1SC1_ADCH3                     ADC1SC1_ADCH3
#define AD1SC1_ADCH3_MASK                ADC1SC1_ADCH3_MASK
#define AD1SC1_ADCH4                     ADC1SC1_ADCH4
#define AD1SC1_ADCH4_MASK                ADC1SC1_ADCH4_MASK
#define AD1SC1_ADCO                      ADC1SC1_ADCO
#define AD1SC1_ADCO_MASK                 ADC1SC1_ADCO_MASK
#define AD1SC1_AIEN                      ADC1SC1_AIEN
#define AD1SC1_AIEN_MASK                 ADC1SC1_AIEN_MASK
#define AD1SC1_COCO                      ADC1SC1_COCO
#define AD1SC1_COCO_MASK                 ADC1SC1_COCO_MASK
#define AD1SC2                           ADC1SC2
#define _AD1SC2                          _ADC1SC2
#define AD1SC2_ACFGT                     ADC1SC2_ACFGT
#define AD1SC2_ACFGT_MASK                ADC1SC2_ACFGT_MASK
#define AD1SC2_ACFE                      ADC1SC2_ACFE
#define AD1SC2_ACFE_MASK                 ADC1SC2_ACFE_MASK
#define AD1SC2_ADTRG                     ADC1SC2_ADTRG
#define AD1SC2_ADTRG_MASK                ADC1SC2_ADTRG_MASK
#define AD1SC2_ADACT                     ADC1SC2_ADACT
#define AD1SC2_ADACT_MASK                ADC1SC2_ADACT_MASK
#define AD1RH                            ADC1RH
#define AD1RH_ADR8                       ADC1RH_ADR8
#define AD1RH_ADR8_MASK                  ADC1RH_ADR8_MASK
#define AD1RH_ADR9                       ADC1RH_ADR9
#define AD1RH_ADR9_MASK                  ADC1RH_ADR9_MASK
#define AD1R                             ADC1R
#define _AD1R                            _ADC1R
#define AD1RL                            ADC1RL
#define AD1RL_ADR0                       ADC1RL_ADR0
#define AD1RL_ADR0_MASK                  ADC1RL_ADR0_MASK
#define AD1RL_ADR1                       ADC1RL_ADR1
#define AD1RL_ADR1_MASK                  ADC1RL_ADR1_MASK
#define AD1RL_ADR2                       ADC1RL_ADR2
#define AD1RL_ADR2_MASK                  ADC1RL_ADR2_MASK
#define AD1RL_ADR3                       ADC1RL_ADR3
#define AD1RL_ADR3_MASK                  ADC1RL_ADR3_MASK
#define AD1RL_ADR4                       ADC1RL_ADR4
#define AD1RL_ADR4_MASK                  ADC1RL_ADR4_MASK
#define AD1RL_ADR5                       ADC1RL_ADR5
#define AD1RL_ADR5_MASK                  ADC1RL_ADR5_MASK
#define AD1RL_ADR6                       ADC1RL_ADR6
#define AD1RL_ADR6_MASK                  ADC1RL_ADR6_MASK
#define AD1RL_ADR7                       ADC1RL_ADR7
#define AD1RL_ADR7_MASK                  ADC1RL_ADR7_MASK
#define AD1CVH                           ADC1CVH
#define AD1CVH_ADCV8                     ADC1CVH_ADCV8
#define AD1CVH_ADCV8_MASK                ADC1CVH_ADCV8_MASK
#define AD1CVH_ADCV9                     ADC1CVH_ADCV9
#define AD1CVH_ADCV9_MASK                ADC1CVH_ADCV9_MASK
#define AD1CV                            ADC1CV
#define _AD1CV                           _ADC1CV
#define AD1CVL                           ADC1CVL
#define AD1CVL_ADCV0                     ADC1CVL_ADCV0
#define AD1CVL_ADCV0_MASK                ADC1CVL_ADCV0_MASK
#define AD1CVL_ADCV1                     ADC1CVL_ADCV1
#define AD1CVL_ADCV1_MASK                ADC1CVL_ADCV1_MASK
#define AD1CVL_ADCV2                     ADC1CVL_ADCV2
#define AD1CVL_ADCV2_MASK                ADC1CVL_ADCV2_MASK
#define AD1CVL_ADCV3                     ADC1CVL_ADCV3
#define AD1CVL_ADCV3_MASK                ADC1CVL_ADCV3_MASK
#define AD1CVL_ADCV4                     ADC1CVL_ADCV4
#define AD1CVL_ADCV4_MASK                ADC1CVL_ADCV4_MASK
#define AD1CVL_ADCV5                     ADC1CVL_ADCV5
#define AD1CVL_ADCV5_MASK                ADC1CVL_ADCV5_MASK
#define AD1CVL_ADCV6                     ADC1CVL_ADCV6
#define AD1CVL_ADCV6_MASK                ADC1CVL_ADCV6_MASK
#define AD1CVL_ADCV7                     ADC1CVL_ADCV7
#define AD1CVL_ADCV7_MASK                ADC1CVL_ADCV7_MASK
#define AD1CFG                           ADC1CFG
#define _AD1CFG                          _ADC1CFG
#define AD1CFG_ADICLK0                   ADC1CFG_ADICLK0
#define AD1CFG_ADICLK0_MASK              ADC1CFG_ADICLK0_MASK
#define AD1CFG_ADICLK1                   ADC1CFG_ADICLK1
#define AD1CFG_ADICLK1_MASK              ADC1CFG_ADICLK1_MASK
#define AD1CFG_MODE0                     ADC1CFG_MODE0
#define AD1CFG_MODE0_MASK                ADC1CFG_MODE0_MASK
#define AD1CFG_MODE1                     ADC1CFG_MODE1
#define AD1CFG_MODE1_MASK                ADC1CFG_MODE1_MASK
#define AD1CFG_ADLSMP                    ADC1CFG_ADLSMP
#define AD1CFG_ADLSMP_MASK               ADC1CFG_ADLSMP_MASK
#define AD1CFG_ADIV0                     ADC1CFG_ADIV0
#define AD1CFG_ADIV0_MASK                ADC1CFG_ADIV0_MASK
#define AD1CFG_ADIV1                     ADC1CFG_ADIV1
#define AD1CFG_ADIV1_MASK                ADC1CFG_ADIV1_MASK
#define AD1CFG_ADLPC                     ADC1CFG_ADLPC
#define AD1CFG_ADLPC_MASK                ADC1CFG_ADLPC_MASK
#define AD1CFG_ADICLK                    ADC1CFG_ADICLK
#define AD1CFG_ADICLK_BITNUM             ADC1CFG_ADICLK_BITNUM
#define AD1CFG_ADICLK_MASK               ADC1CFG_ADICLK_MASK
#define AD1CFG_ADIV                      ADC1CFG_ADIV
#define AD1CFG_ADIV_BITNUM               ADC1CFG_ADIV_BITNUM
#define AD1CFG_ADIV_MASK                 ADC1CFG_ADIV_MASK
#define AD1CFG_MODE                      ADC1CFG_MODE
#define AD1CFG_MODE_BITNUM               ADC1CFG_MODE_BITNUM
#define AD1CFG_MODE_MASK                 ADC1CFG_MODE_MASK
#define AD1CVH_ADCV                      ADC1CVH_ADCV
#define AD1CVH_ADCV_8                    ADC1CVH_ADCV_8
#define AD1CVH_ADCV_8_BITNUM             ADC1CVH_ADCV_8_BITNUM
#define AD1CVH_ADCV_8_MASK               ADC1CVH_ADCV_8_MASK
#define AD1RH_ADR                        ADC1RH_ADR
#define AD1RH_ADR_8                      ADC1RH_ADR_8
#define AD1RH_ADR_8_BITNUM               ADC1RH_ADR_8_BITNUM
#define AD1RH_ADR_8_MASK                 ADC1RH_ADR_8_MASK
#define AD1SC1_ADCH                      ADC1SC1_ADCH
#define AD1SC1_ADCH_BITNUM               ADC1SC1_ADCH_BITNUM
#define AD1SC1_ADCH_MASK                 ADC1SC1_ADCH_MASK
#define IIC1A_ADDR_BITNUM                IIC1A_ADDR_1_BITNUM
#define IIC1A_ADDR_MASK                  IIC1A_ADDR_1_MASK
#define NVPROT_FPS_BITNUM                This_symb_has_been_depreciated
#define NVPROT_FPS_MASK                  This_symb_has_been_depreciated

