jimherd/Robokid_B3/mc9s08aw60.h
/*
 * Follows changes from the database 2.87.179 version */
#define KBIPE                            KBI1PE
#define KBIPE_KBIPE0                     KBI1PE_KBIPE0
#define KBIPE_KBIPE0_MASK                KBI1PE_KBIPE0_MASK
#define KBIPE_KBIPE1                     KBI1PE_KBIPE1
#define KBIPE_KBIPE1_MASK                KBI1PE_KBIPE1_MASK
#define KBIPE_KBIPE2                     KBI1PE_KBIPE2
#define KBIPE_KBIPE2_MASK                KBI1PE_KBIPE2_MASK
#define KBIPE_KBIPE3                     KBI1PE_KBIPE3
#define KBIPE_KBIPE3_MASK                KBI1PE_KBIPE3_MASK
#define KBIPE_KBIPE4                     KBI1PE_KBIPE4
#define KBIPE_KBIPE4_MASK                KBI1PE_KBIPE4_MASK
#define KBIPE_KBIPE5                     KBI1PE_KBIPE5
#define KBIPE_KBIPE5_MASK                KBI1PE_KBIPE5_MASK
#define KBIPE_KBIPE6                     KBI1PE_KBIPE6
#define KBIPE_KBIPE6_MASK                KBI1PE_KBIPE6_MASK
#define KBIPE_KBIPE7                     KBI1PE_KBIPE7
#define KBIPE_KBIPE7_MASK                KBI1PE_KBIPE7_MASK
#define KBISC                            KBI1SC
#define KBISC_KBIMOD                     KBI1SC_KBIMOD
#define KBISC_KBIMOD_MASK                KBI1SC_KBIMOD_MASK
#define KBISC_KBIE                       KBI1SC_KBIE
#define KBISC_KBIE_MASK                  KBI1SC_KBIE_MASK
#define KBISC_KBACK                      KBI1SC_KBACK
#define KBISC_KBACK_MASK                 KBI1SC_KBACK_MASK
#define KBISC_KBF                        KBI1SC_KBF
#define KBISC_KBF_MASK                   KBI1SC_KBF_MASK
#define KBISC_KBEDG4                     KBI1SC_KBEDG4
#define KBISC_KBEDG4_MASK                KBI1SC_KBEDG4_MASK
#define KBISC_KBEDG5                     KBI1SC_KBEDG5
#define KBISC_KBEDG5_MASK                KBI1SC_KBEDG5_MASK
#define KBISC_KBEDG6                     KBI1SC_KBEDG6
#define KBISC_KBEDG6_MASK                KBI1SC_KBEDG6_MASK
#define KBISC_KBEDG7                     KBI1SC_KBEDG7
#define KBISC_KBEDG7_MASK                KBI1SC_KBEDG7_MASK
#define KBISC_KBEDG_4                    KBI1SC_KBEDG_4
#define KBISC_KBEDG_4_BITNUM             KBI1SC_KBEDG_4_BITNUM
#define KBISC_KBEDG_4_MASK               KBI1SC_KBEDG_4_MASK
#define KBISC_KBEDG                      KBI1SC_KBEDG
#endif
